app/controllers/authors_controller.rb

  def zero_authors_or_authenticated
    unless Author.count == 0 || current_user
---
SELECT COUNT(*) FROM "authors"

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["salt", "ZsXo5VHYzdB5pmGfcsWY"], ["crypted_password", "$2a$10$wp4qfa4.Fp0iihP2/Q6H2.qUFQW2na2jsUgXAIrjkAza8GomAnvGW"], ["updated_at", "2020-07-01 21:56:52.646366"], ["id", 1]]